InformationRegisters/Логи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Логи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РезультатыОбновлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обновляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеОтложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтключениеПользователей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Базы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Базы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЛогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТестовыйКонтур</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТестовыеКонтуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExecuteCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Административная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF</Name>
					<Comment>Параметр устанавливаемый для базы через которую будет осуществляться выгрузка CF</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Логи/Ext/ManagerModule.bsl
&НаСервере
Функция СнятьЗаписиОбновленияБазы(База) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Логи.Период,
	|	Логи.База,
	|	Логи.Лог,
	|	Логи.Результат,
	|	Логи.ДатаОкончания,
	|	Логи.Пользователь
	|ИЗ
	|	РегистрСведений.Логи КАК Логи
	|ГДЕ
	|	Логи.Результат = ЗНАЧЕНИЕ(Перечисление.РезультатыОбновлений.Обновляется)
	|	И Логи.База = &База");
	Запрос.УстановитьПараметр("База", База);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Менеджер = РегистрыСведений.Логи.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
		Менеджер.Лог = ПопыткаПолучитьЛог(База, Выборка.Период);
		Менеджер.Результат = Перечисления.РезультатыОбновлений.Ошибка;
		Менеджер.Записать(Истина);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПоследнееНеДинамическоеОбновление(База) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЛогиСрезПоследних.ДатаОкончания
	                      |ИЗ
	                      |	РегистрСведений.Логи.СрезПоследних(
	                      |			,
	                      |			База = &База
	                      |				И Лог ПОДОБНО ""%Старт не динамического обновления%"") КАК ЛогиСрезПоследних");
	Запрос.УстановитьПараметр("База", База);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ДатаОкончания;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПопыткаПолучитьЛог(База, Период)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЛогиСрезПоследних.Лог,
	|	Базы.ПутьКФайлуЛогов
	|ИЗ
	|	РегистрСведений.Логи.СрезПоследних(&Период, База = &База) КАК ЛогиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Базы КАК Базы
	|		ПО ЛогиСрезПоследних.База = Базы.Ссылка");
	Запрос.УстановитьПараметр("База", База);
	Запрос.УстановитьПараметр("Период", Период - 1);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ЛогИзФайла = ОбновлениеВФоне.ПолучитьЛогИзФайла(Выборка.ПутьКФайлуЛогов);
		Если НЕ Найти(Выборка.Лог, ЛогИзФайла) Тогда 
			Возврат ЛогИзФайла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат "Что-то пошло не так...";
	
КонецФункции

&НаСервере
Процедура ОтложитьОбновление(МассивБаз) Экспорт 
	
	ТекстКода = "Константы.споОбновление.Установить(Ложь); 
	|  Результат = ЗначениеВСтрокуВнутр(Истина);";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЛогиСрезПоследних.Период,
	                      |	ЛогиСрезПоследних.База,
						  |	ЛогиСрезПоследних.Лог,
	                      |	ЛогиСрезПоследних.Результат,
	                      |	ЛогиСрезПоследних.ДатаОкончания,
	                      |	ЛогиСрезПоследних.Пользователь
	                      |ИЗ
	                      |	РегистрСведений.Логи.СрезПоследних(
	                      |			,
	                      |			Результат = ЗНАЧЕНИЕ(Перечисление.РезультатыОбновлений.ОжидаетсяОтключениеПользователей)
	                      |				И База В (&Базы)) КАК ЛогиСрезПоследних");
	Запрос.УстановитьПараметр("Базы", МассивБаз);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений.Логи.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
		Менеджер.Результат = Перечисления.РезультатыОбновлений.ОбновлениеОтложено;
		Менеджер.Записать();
	КонецЦикла;
	
	Для Каждого База Из  МассивБаз Цикл 
		Результат = РаботаСВеб.ВыполнитьКодWS(База, ТекстКода);
	КонецЦикла;
	
КонецПроцедуры
